/***********************************************************************************
  Filename:     bh1750.h

  Description:  光线传感器

***********************************************************************************/

#ifndef __BH1750_H
#define __BH1750_H
/*********************************************头文件包含******************************************/
#include "iic.h"
#include "delay.h"


/************************************************常量定义****************************************/
typedef enum{
	BH1750_POWERDOWN 	= 0x00,
	BH1750_POWERON		= 0x01,
	BH1750_RESET			= 0x07,
	BH1750_MODE_CH		= 0x10,
	BH1750_MODE_CH2		= 0x11,
	BH1750_MODE_CL		= 0x13,
	BH1750_MODE_OH		= 0x20,
	BH1750_MODE_OH2		= 0x21,
	BH1750_MODE_OL		= 0x23,
	BH1750_TIME_H			= 0x40,
	BH1750_TIME_L			= 0x60
}bhCommand;


typedef enum{
	BH1750_ADD_W = 0xB8, 						//写入地址
	BH1750_ADD_R = 0xB9,					        //读取地址
}bhSlaveAdd;								//设备地址，ADD=1




/************************************************函数声明****************************************/
u8 BH1750_WriteCommand(u8 cmd);           //写入命令
u8 BH1750_ReadData(float *rst,u8 mode);   //读取命令


#endif

